pikaky/stm32/spi/usart.c
#include "stm32f10x.h"                  // Device header

void usart1_init(void)
	
{
	
	//先配置usart 再配置gpio 不然gpio初始化时有可能会发送一个0xff 产生干扰
	
	//打开usart1上的的时钟   
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	
	//配置USART_InitTypeDef 初始化结构体
	
	USART_InitTypeDef USART_InitStruct; // 定义结构体
	USART_InitStruct.USART_BaudRate = 115200; //定义波特率
	USART_InitStruct.USART_WordLength = USART_WordLength_8b;  //定义有效位长度
	USART_InitStruct.USART_StopBits = USART_StopBits_1; //选择一位的停止位
	USART_InitStruct.USART_Parity = USART_Parity_No; //这里采用无校验
	USART_InitStruct.USART_Mode = USART_Mode_Rx|USART_Mode_Tx; //发送模式 接收模式都打开
	USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_Init(USART1, &USART_InitStruct); //调用初始化函数

	//配置串口中断优先级 接收时开启中断 
	
	NVIC_InitTypeDef NVIC_InitStruct; //命名结构体
	//优先级分组  例子中选择主1 子3 分组2
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	// 配置nvic初始化结构体
	// 中断源的值在stm32f10x.h 里找   大容量用hd下面的 
	NVIC_InitStruct.NVIC_IRQChannel = USART1_IRQn; //采用USART1
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 1; //主优先级1
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 1; //子优先级1
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE; //使能
	
	NVIC_Init(&NVIC_InitStruct); //调用初始化函数
	
	// 配置串口中断     接收寄存器空时产生中断
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	

	// 使能串口
	USART_Cmd(USART1, ENABLE);
	
	
	// 清除串口标志位   tx上最好上接一个上拉 不然上电时候会发送一个0xff
	USART_ClearFlag( USART1, USART_FLAG_TC );
	
	
	
	//配置pa9 io口
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP; //选择复用模式 推挽输出
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	//配置pa10 io口
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING; //选择浮空输入
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
}

// 发送一个字节
void usart_sendbyte(USART_TypeDef* USARTx,uint8_t Data)
{
	USART_SendData(USARTx,Data);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET); //判断发送寄存器空 
}

// 发送2个字节
void usart_send2byte(USART_TypeDef* USARTx,uint16_t Data)
{
	unsigned char temph,templ; //定义一个高8位和低8位
	temph= (Data&0xff00)>>8;  //提取高8位并放到最左边 因为等等只会发送前面8个bit
	templ= Data&0xff; //提取低8位
	
	//先发送高8位 然后低8位
	USART_SendData(USARTx,temph);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);	//判断发送完毕

	//再发送低8位 然后低8位
	USART_SendData(USARTx,templ);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);
}

// 发送4个字节 int
void usart_send4byte(USART_TypeDef* USARTx,uint32_t Data)
{
	unsigned char temp1,temp2,temp3,temp4=0; 
	temp1= (Data&0xff000000)>>24;  //提取高8位并放到最左边 因为等等只会发送前面8个bit
	temp2= (Data&0x00ff0000)>>16; //提取8位
	temp3= (Data&0x0000ff00)>>8;
	temp4= (Data&0x000000ff)>>0;
	
	//先发送高8位 然后低8位
	USART_SendData(USARTx,temp1);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);	//判断发送完毕

	USART_SendData(USARTx,temp2);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);
	
	USART_SendData(USARTx,temp3);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);
	
	USART_SendData(USARTx,temp4);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);
}



// 发送数组                               数组指针            数组个数
void usart_sendarr(USART_TypeDef* USARTx,unsigned char *arr,unsigned char arrnumber)
{
	unsigned char i;
	for(i=0;i<arrnumber;i++)
	{
		USART_SendData(USARTx,arr[i]);
		while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET); 
	}
	
	// 直接判断发送完成 标志位
	
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TC)==RESET);
	
}

// 发送32位数组                               数组指针            数组个数
void usart_sendarr32(USART_TypeDef* USARTx,unsigned int *arr,unsigned char arrnumber)
{
	unsigned char i;
	unsigned char temph,templ,tempu,tempm; //定义一个高8位和低8位
	
	
	for(i=0;i<arrnumber;i++)
	{
	
	temph= (arr[i]&0xff000000)>>24;  //提取高8位并放到最左边 因为等等只会发送前面8个bit
	tempm= (arr[i]&0x00ff0000)>>16; //提取8位
	templ= (arr[i]&0x0000ff00)>>8;
	tempu= (arr[i]&0x000000ff)>>0;
	
	//先发送高8位 然后低8位
	USART_SendData(USARTx,temph);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);	//判断发送完毕

	//再发送低8位 然后低8位
	USART_SendData(USARTx,tempm);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);
	
	USART_SendData(USARTx,templ);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);	//判断发送完毕

	USART_SendData(USARTx,tempu);
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);
		
	}
	
	// 直接判断发送完成 标志位
	
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TC)==RESET);
	
}

// 发送字符串
void usart_sendstr(USART_TypeDef* USARTx,unsigned char *str)
{ 
	unsigned char i = 0; //想发中文的话 把keil编码从u-8改成gbk或2312
	do
	{
	USART_SendData(USARTx,*(str+i));	
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TXE)==RESET);
	i++;	
	}while(*(str+i)!='\0');   //字符串以\0结束 用这个来判断
	
	while(USART_GetFlagStatus(USARTx,USART_FLAG_TC)==RESET);
}



unsigned char usart_recieve_data(USART_TypeDef* USARTx)
{
while(USART_GetFlagStatus(USARTx,USART_FLAG_RXNE)==RESET);	
	
return USART_ReceiveData(USARTx);

}
